Repository: gautamkrishnar/socli
Catalog: socli/locale/*/LC_MESSAGES/socli.po
Languages: es_ar

source: p: previous answer, n: next answer, o: open in browser, b: back
es_ar: p: respuesta anterior, n: respuesta siguiente, o: abrir en el navegador, b: atras

source: Opening in your browser...
es_ar: Abriendo en el navegador...

source: No previous answers.
es_ar: No hay respuestas anteriores

source: No more answers.
es_ar: No hay mas respuestas

source: Question:
es_ar: Pregunta:

source: Error name:
es_ar: Nombre de error:

source: Description:
es_ar: Descripcion:

source: Encoding error: Use "chcp 65001" command before using socli...
es_ar: Error de codificacion: Use el comando "chcp 65001" antes de usar socli...

source: Please check your internet connectivity...
es_ar: Por favor, revise su conexion a internet

source: Stack Overflow command line client:
es_ar: Cliente para linea de comandos de Stack Overflow:

source: Usage: socli [ Arguments ] < Search Query >
es_ar: Uso: socli [ Argumentos ] < Buscar consulta >

source: [ Arguments ] (optional):
es_ar: [ Argumentos ] (opcional):

source: : Displays this help
es_ar: : Muestra esta ayuda

source: --help or -h
es_ar: --help o -h

source: --query or -q
es_ar: --query o -q

source: : If any of the following commands are used then you
es_ar: : Si se utiliza alguno de los siguientes comandos

source: must specify search query after the query argument
es_ar: tiene que especificar una consulta de busqueda despues de los argumentos de la consulta

source: : To search in Stack Overflow
es_ar: : Para buscar en Stack Overflow

source: --interactive or -i
es_ar: --interactive o -i

source: and display the matching results. You can chose and
es_ar: y mostrar los resultados que concuerden. Puede elegir y

source: browse any of the result interactively
es_ar: navegar cualquiera de los resultados interactivamente

source: --res or -r
es_ar: --res o -r

source: : To select and display a result manually and display
es_ar: : Para seleccionar y mostrar un resultado manualmente ademas mostrar

source: its most voted answer. eg:
es_ar: su respuesta mas votada ej:

source: : Displays the second search result of the query
es_ar: : Mostrar el segundo resultado de busqueda de la consulta

source: --tag or -t
es_ar: --tag o -t

source: : To search a query by tag on Stack Overflow. Visit http://stackoverflow.com/tags to see the
es_ar: : Para buscar una consulta por etiqueta en Stack Overflow. Visite http://stackoverflow.com/tags para ver la

source: list of all tags.
es_ar: lista de todas las etiquetas.

source: eg:
es_ar: ej:

source: : Displays the search result of the query
es_ar: : Muestra el resultado de busqueda de una consulta

source: "foo bar" in Stack Overflow's javascript and node.js tags.
es_ar: "foo bar" en las etiquetas de javascript y node.js en Stack Overflow.

source: : Opens the documentation of Python2 and Python3 and let you navigate through
es_ar: : Abre la documentacion de Python2 y Python3 y te deja

source: it.
es_ar: navegarla.

source: --new or -n
es_ar: --new o -n

source: : Opens the Stack Overflow new questions page in your default browser. You can create a
es_ar: : Abre la pagina de nuevas preguntas de Stack Overflow en tu navegador predeterminado. Puedes crear una

source: new question using it.
es_ar: nueva pregunta usandola.

source: --user or -u
es_ar: --user o -u

source: : Displays information about the user provided as the next argument(optional). If no argument is provided
es_ar: : Muestra informacion sobre el usuario proporcionado como el siguiente argumento(opcional). Si ningun argumento es proporcionado

source: it will ask the user to enter a default username. Now the user can run the command without the argument.
es_ar: va a pedir un nombre de usuario por defecto. Ahora el usuario podria ejecutar el comando sin el argumento.

source: : Prompts and saves your username. Now you can just run
es_ar: : Promtea y graba tu nombre de usuario. Ahora podes correr

source: to see
es_ar: para ver

source: : Displays info about user ID 22656
es_ar: : Muestra informacion sobre el ID de usuario 22656

source: the stats.
es_ar: las estadisticas.

source: --del or -d
es_ar: --del o -d

source: : Deletes the configuration file generated by
es_ar: : Elimina el archivo de configuracion generado por

source: command.
es_ar: comando.

source: --api or -a
es_ar: --api o -a

source: : Sets a custom API key for socli
es_ar: : Establece una clave API personalizada para socli

source: --sosearch or -s
es_ar: --sosearch o -s

source: : SoCLI uses google search by default. Use this option to search Stack Overflow directly.
es_ar: : SoCLI utiliza la busqueda de Google por defecto. Utilice esta opcion para buscar en Stack Overflow directamente.

source: --login or -l
es_ar: --login o -l

source: : Login to Stack Overflow using your email and password.
es_ar: : Inicio de sesion en Stack Overflow usando su correo electronico y contrasenha.

source: : Logout of Stack Overflow.
es_ar: : Salir de Stack Overflow.

source: < Search Query >:
es_ar: < Buscar consulta >:

source: Query to search on Stack Overflow
es_ar: Consulta a buscar en Stack Overflow

source: If no commands are specified then socli will search Stack
es_ar: Si no se especifican comandos, socli busca en Stack

source: Overflow and simply displays the first search result's
es_ar: Overflow y simplemente muestra el primer resultado de la b√∫squeda

source: most voted answer.
es_ar: No hay mas respuestas

source: If a command is specified then it will work according to the
es_ar: Si un comando se especifica entonces se trabajara de acuerdo al

source: command.
es_ar: comando.

source: Examples:
es_ar: Ejemplos:

source: socli for loop in python
es_ar: socli bucle for en python

source: socli -iq while loop in python
es_ar: socli -iq bucle while en python

source: SoCLI is an open source project hosted on github. Don't forget to star it if you liked it. Use GitHub
es_ar: SoCLI es un proyecto de codigo abierto alojado en Github. No se olvide de darle a la estrella si le ha gustado. Use GitHub

source: issues to report problems:
es_ar: para reportar problemas:

source: No results found...
es_ar: No se encontraron resultados...

source: No answers for this question ...
es_ar: No hay respuestas para esta pregunta

source: Select a question below:
es_ar: Seleccione una de las siguientes preguntas:

source: Type the option no to continue or any other key to exit:
es_ar: Escriba la opcion no para continuar o cualquier otra tecla para salir:

source: to next answer,
es_ar: a la siguiente respuesta,

source: to open in browser,
es_ar: para abrir en el navegador,

source: Type
es_ar: Escriba

source: for previous answer or any other key to exit:
es_ar: para la respuesta anterior o cualquier otra tecla para salir:

source: Answer:
es_ar: Respuesta:

source: No more answers found for this question. Exiting...
es_ar: No se encontraron mas respuestas para esta pregunta. Salir...

source: You cant go further back. You are on the first answer!
es_ar: No puedes volver atras. Estas en la primer respuesta!

source: Wrong option. select the option no to continue:
es_ar: Opcion incorrecta. Selecciona la opcion no para continuar:

source: Exiting...
es_ar: Saliendo...

source: Encoding error: Use "chcp 65001" command before using socli...
es_ar: Encoding error: Use el comando "chcp 65001" antes de usar socli...

source: exiting...
es_ar: saliendo...

source: Count starts from 1. Use: "socli -i 2 -q python for loop" for the 2nd result for the query
es_ar: El conteo empieza desde 1. Use: "socli -i 2 -q python for loop" para el 2do resultado para la query

source: User ID must be an integer.
es_ar: El ID de usuario debe ser un entero.

source: Follow the instructions on this page to get your User ID: http://meta.stackexchange.com/a/111130
es_ar: Siga las instrucciones en esta pagina para obtener su Id de usuario: http://meta.stackexchange.com/a/111130

source: Total Questions Asked:
es_ar: Total de preguntas hechas:

source: Accept rate is:
es_ar: Tasa de aceptacion:

source: Most experienced on
es_ar: Mas exprimentado en

source: You have 0 answers
es_ar: Usted tiene 0 respuestas

source: Most curious about
es_ar: Mas curioso sobre

source: You have 0 questions
es_ar: Usted tiene 0 preguntas

source: c: check another profile, d: delete this user information and exit, any key: save information and exit
es_ar: c: revisar otro perfil, d: borrar la informacion de este usuario y salir, cualquier tecla: guardar la informacion y salir

source: Data files deleted...
es_ar: Archivos de informacion borrados...

source: 400 [bad_parameter]: `key` doesn't match a known application
es_ar: 400 [bad_parameter]: `key` no coincide con un uso conocido

source: Wrong API key... Deleting the data file...
es_ar: API key incorrecta... Borrando el archivo de datos...

source: not enough values to unpack (expected 1, got 0)
es_ar: no hay suficientes valores para desenpaquetar (esperaba 1, obtuvo 0)

source: Wrong user ID specified...
es_ar: ID de usuario especificado incorrecto...

source: Wrong user ID... Deleting the data file...
es_ar: ID de usuario incorrecto... Borrando el archivo de datos...

source: Stackoverflow exception. This might be caused due to the rate limiting: http://stackapps.com/questions/3055/is-there-a-limit-of-api-requests
es_ar: Excepcion de Stackoverflow. Esto puede ser causado por tu limite de pedidos: http://stackapps.com/questions/3055/is-there-a-limit-of-api-requests

source: Use http://stackapps.com/apps/oauth/register to register a new API key.
es_ar: Use http://stackapps.com/apps/oauth/register para registrar una nueva clave API.

source: Type an API key to continue:
es_ar: Escriba una clave API para continuar:

source: API Key saved...
es_ar: Clave API guardada...

source: File not created.... Use socli -u to create a new configuration file.
es_ar: Archivo no creado.... Use socli -u para crear un nuevo archivo de configuracion.

source: Could not load statistics.
es_ar: No se pudieron cargar la estadisticas.

source: Google thinks you're a bot because you're issuing too many queries too quickly!
es_ar: Google piensa que sos un robot porque estas enviando muchas queries muy rapido!

source: Now you'll have to wait about an hour before you're unblocked... :(. Use the -s tag
es_ar: Ahora vas a tener que esperar una hora para ser desbloqueado... :(. Use el tag -s

source: to search via Stack Overflow instead.
es_ar: para buscar a traves de Stack Overflow en su lugar.

source: StackOverflow captcha check triggered. Please wait a few seconds before trying again.
es_ar: El captcha de StackOverflow se activo. Por favor espere unos segundos antes de tratar nuevamente.

source: Default user not set...
es_ar: No se establecio un usuario por defecto...

source: Enter your Stackoverflow User ID:
es_ar: Introduzca su ID de usuario de Stack Overflow:

source: UserID saved...
es_ar: ID de usuario guardado...

source: Invalid choice!
es_ar: ¬°Eleccion invalida!

source: Enter your choice:
es_ar: Ingrese su eleccion

source: Invalid choice, try again.
es_ar: Eleccion invalida, intentelo nuevamente.

source: Enter:
es_ar: Ingrese:

source: q: quit l: documentation menu c: change python version
es_ar: q: salir l: menu de documentacion c: cambiar version de python

source: Invalid choice.
es_ar: Eleccion invalida.

source: Stack Overflow command line client
es_ar: Cliente para linea de comandos de Stack Overflow

source: Show this help message and exit
es_ar: Mostrar este mensaje de ayuda y salir

source: Opens the stack overflow new questions page in your default browser. You can create a new question using it.
es_ar: Abre la pagina de nuevas preguntas de Stack Overflow en tu navegador predeterminado. Puedes crear una nueva pregunta usandola.

source: To search in Stack Overflow and display the matching results. You can choose and browse any of the results interactively
es_ar: Para buscar en Stack Overflow y mostrar los resultados que concuerdan. Podes elegir y navegar cualquiera interactivamente

source: Turn debugging mode on
es_ar: Encender el modo debbuger

source: Searches directly on Stack Overflow instead of using Google
es_ar: Busca directamente en Stack Overflow en vez de usar Google

source: Sets a custom API key for socli
es_ar: Establece una API key personalizada para socli

source: Deletes the configuration file generated by socli -u command
es_ar: Borra el archivo de configuracion de socli generado por -u command

source: Displays information about the user provided as the next argument(optional). If no argument is provided it will ask the user to enter a default username. Now the user can run the command without the argument
es_ar: Muestra la informacion sobre el usuario dado como el siguiente argumento(opcional). Si no se provee ningun argumento va a pedir un nombre de usuario por defecto. Ahora el usuario puede ejecutar el comando sin el argumento

source: To search a query by tag on stack overflow.Visit http://stackoverflow.com/tags to see the list of all tags. eg:- socli --tag javascript,node.js --query foo bar: Displays the search result of the query "foo bar" in stack overflow's javascript and node.js tags
es_ar: Para buscar una consulta por etiqueta en stack overflow. Visitar http://stackoverflow.com/tags para ver la lista de todas las etiquetas. ej:- socli --tag javascript,node.js --query foo bar: Muestra los resultados de busqueda de la consulta "foo bar" en las etiquetas javascript y node.js de stack overflow

source: If any of the following commands are used then you must specify this option and a query following it.
es_ar: Si cualquiera de los siguiente comandos es usado, tiene que especificar esta opcion y la consulta a continuacion.

source: To select and display a result manually and display its most voted answer. eg:- socli --res 2 --query foo bar: Displays the second search result of the query "foo bar"'s most voted answer
es_ar: Para mostrar y seleccionar el resultado manualmente con su respuesta mas votada. ej:- socli --res 2 --query foo bar: Muestra el segundo resultado de busqueda de la consulta "foo bar" de su respuesta mas votada

source: Prompt a user for email and password to login to StackOverflow.
es_ar: Indique un usuario por email y contrase√±a para ingresar en StackOverflow.

source: Log a user out of StackOverflow
es_ar: Desconectar un usuario de StackOverflow

source: View Python documentation
es_ar: Ver documentacion de Python

source: Opening stack overflow in your browser...
es_ar: Abriendo Stack Overflow en el navegador...

source: You must specify a query or a tag. For example, use: "socli -r 3 -q python for loop" to retrieve the third result when searching about "python for loop". You can also use "socli -r 3 -t python" to retrieve the third result when searching for posts with the "python" tag.
es_ar: Tiene que especificar una consulta o etiqueta. Por ejemplo, use: "socli -r 3 -q python for loop" para obtener el tercer resultado buscando sobre "python for loop". Tambien puede usar "socli -r 3 -t python" para obtener el tercer resultado buscando publicaciones con la etiqueta "python".

source: You must specify a query or a tag. For example, use: "socli -iq python for loop" to search about "python for loop" in interactive mode. You can also use "socli -it python" to search posts with the "python" tag in interactive mode.
es_ar: Tiene que especificar una consulta o etiqueta. Por ejemplo, use: "socli -iq python for loop" para buscar sobre "python for loop" en modo interactivo. Tambien puede usar "socli -it python" para buscar publicaciones con la etiqueta "python" en modo interactivo.
